import Header from "../components/Header";
import styled from "styled-components";
import NavigationBar from "../components/NavigationBar";
const MainContainer = styled.div`
  width: 100%;
  margin: 0 auto;
  margin-top: 30px;
  color: var(--Gray-Scale-Gray-700, #50535c);
  font-family: Pretendard;
  font-size: 16px;
  line-height: 1.5;
  text-align: left;
`;

const PersonalInfo = () => {
  return (
    <div>
      <Header title="개인정보 처리방침" />
      <MainContainer>
        <p>
          개인정보처리방침
          <br />
          코쓱(이하 '회사')은(는) 개인정보보호법 제30조에 의거하여 이용자의
          개인정보 및 권익을 보호하고 이와 관련한 고충 및 불만을 신속하게
          처리하기 위하여 아래와 같이 개인정보 처리방침을 수립하여 운영하고
          있습니다. 우리 회사는 관계법령에서 규정하고 있는 책임과 의무를
          준수하고 실천하기 위해 최선의 노력을 하고 있습니다.
          <br />
          <br />
          목차
          <br />
          제1조 개인정보의 수집 및 이용에 관한 안내
          <br />
          제2조 민감정보의 처리에 관한 사항
          <br />
          제3조 개인정보의 보유기간 및 파기
          <br />
          제4조 개인정보 처리 위탁
          <br />
          제5조 개인정보의 제3자 제공
          <br />
          제6조 개인정보의 안전성 확보조치
          <br />
          제7조 이용자 및 법정대리인의 권리와 그 행사 방법
          <br />
          제8조 개인정보 처리방침 변경에 관한 사항
          <br />
          <br />
          제1조 (개인정보의 수집 및 이용에 관한 안내) 회사는 서비스 이용에
          필요한 최소한의 개인정보를 수집하고 있습니다. 회사는 이용자의
          개인정보를 아래와 같이 처리합니다. 개인정보 수집 및 이용 회원제 서비스
          제공에 따른 회원가입 의사 확인, 회원탈퇴 의사 확인, 회원자격 유지 및
          관리 회원가입 및 로그인 시 본인 식별·인증 관련법령, 이용약관 등
          위반행위에 대한 제재, 부정 이용 행위를 포함하여 서비스의 원활한 운영에
          지장을 주는 행위에 대합 방지 및 제재 이용자가 안심하고 이용할 수 있는
          안전한 서비스 이용환경 구축 각종 고지 및 통지 회사는 다양한 서비스
          제공을 위해 이용자에게 동의를 받고 추가적인 개인정보를 수집할 수
          있습니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는
          이용되지 않으며, 이용 목적이 변경되는 경우에는 「개인정보 보호법」
          제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
          <br />
          제2조 (민감정보의 처리에 관한 사항) 회사는 이용자의 민감한 개인정보를
          수집하지 않습니다.
          <br />
          제3조 (개인정보의 보유기간 및 파기) 코쓱은 법령에 따른 개인정보
          보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은
          개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다. 코쓱은
          원칙적으로 이용자의 회원 탈퇴(이용계약 해지) 시 해당 이용자의
          개인정보를 재생 불가능한 방법으로 지체 없이 파기합니다. 단,
          이용자로부터 별도 동의를 얻은 경우나, 관계 법령 위반에 따른 수사·조사
          등이 진행 중인 경우에는 해당 수사·조사 종료 시까지 이를 보관합니다.
          코쓱은 다음의 개인정보 항목을 처리하고 있습니다. 필수 항목보유 및
          이용기간구글 계정을 연동한 회원가입이용자 고유 식별자, 이메일 주소,
          닉네임회원탈퇴시까지 ※단, 관계 법령 위반에 따른 수사·조사 등이 진행
          중인 경우에는 해당 수사·조사 종료 시까지 보관함. 또한, 이용자의 서비스
          이용과정에서 서비스 이용 기록(접속 일시, 이용과정에서 발생하는 정상
          또는 비정상 로그 등), IP 주소, 기기정보, 광고식별자 등의 정보가
          생성되어 수집될 수 있습니다. 코쓱은 아래의 방법을 통해 이용자의
          개인정보를 수집합니다. 회원가입 및 서비스 이용시 이용자가 직접 정보를
          입력하는 경우, 해당 개인정보를 수집합니다. 이용자의 문의 및 응대시
          웹페이지, 메일, 전화 등을 통해 이용자의 개인정보가 수집될 수 있습니다.
          서비스 이용 정보 및 생성정보 등은 이용 과정에서 자동으로 생성되어
          수집될 수 있습니다.
          <br />
          제4조 (개인정보 처리 위탁) 이용자로부터 개인정보 보관기간에 대해
          회원가입시 동의를 얻은 경우의 개인정보 처리 및 보유 기간은 다음과
          같습니다. 회원의 이용자 고유 식별자는 탈퇴일로부터 30일 간 보관(민원
          등 처리 목적)합니다. 수탁자: Notion / 위탁업무: 로그 분석 및 온라인
          광고 성과 추적 수탁자: Google Analytics Academy / 위탁업무: 로그 분석
          및 온라인 광고 성과 추적 수탁자: 뷰저블 / 위탁업무: 로그 분석 및
          온라인 광고 성과 추적
          <br />
          제5조 (개인정보의 제3자 제공) 코쓱은 정보주체의 개인정보를 ‘제1조
          개인정보의 수집 및 이용에 관한 안내’에서 명시한 범위 내에서만
          처리하며, 이용자의 별도 사전동의, 관련 법령의 특별한 요구가 발생하는
          경우에만 개인정보를 제3자에게 제공합니다. 관계법령에 의거 사전 동의
          없이 제3자에게 제공되는 정보 통계작성, 학술연구 또는 시장조사를 위하여
          필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우
          관계법령에 의하여 국가기관으로부터 요구받은 경우 범죄에 대한 수사상의
          목적이 있거나, 정보통신 윤리위원회의 요청이 있는 경우 기타
          관계법령에서 정한 절차에 따른 요청이 있는 경우 긴급상황 발생 시
          개인정보 제공 안내 재난, 감염병, 급박한 생명·신체 위험을 초래하는
          사건·사고, 급박한 재산 손실 등의 긴급상황이 발생하는 경우 정보주체의
          동의 없이 관계기관에 개인정보를 제공할 수 있습니다. 긴급상황은 정부
          관계부처가 합동으로 발표한 「긴급상황 시 개인정보 처리 및 보호수칙」을
          기준으로 합니다.
          <br />
          제6조 (개인정보의 안전성 확보조치) 코쓱은 이용자의 개인정보를 안전하게
          관리하여 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 최선을
          다하고 있으며 필요한 기술적·관리적 및 물리적 조치를 하고 있습니다.
          제7조 (이용자 및 법정대리인의 권리와 그 행사 방법) 이용자는 언제든지
          자신의 개인정보를 조회하거나 수정 또는 삭제할 수 있고, 코쓱 자신의
          개인정보에 대한 열람, 정정, 처리정지, 삭제를 요청할 수 있으며,
          회원탈퇴 등을 통해 개인정보의 수집 및 이용동의를 철회할 수 있습니다.
          동의 철회: 마이페이지 ,설정, 회원 탈퇴 이용자가 개인정보의 오류에 대한
          정정 또는 삭제를 요청한 경우, 코쓱은 이를 완료하기 전까지 해당
          개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를
          제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이
          통지하여 정정이 이루어지도록 합니다. 이용자의 권리행사는 이용자의
          법정대리인이나 위임받은 자 등을 통해서도 하실 수 있고, 이 경우에는
          적법한 위임장 제출이 필요합니다.
          <br />
          제8조 (개인정보 수집 동의 거부) 회원은 개인정보 수집 및 이용에 대한
          동의를 거부할 권리가 있으며, 동의를 거부할 경우 받는 별도의 불이익은
          없습니다. 단, 필수 동의 사항에 동의를 거부할 경우, 서비스 이용이
          불가능하거나 서비스 이용 목적에 따른 서비스 제공에 제한이 따르게
          됩니다. 이 개인정보 처리방침은 시행일로부터 적용됩니다. 개인정보
          처리방침의 내용은 관련법령, 정부의 정책 또는 보안기술의 변경 등에 따라
          변경될 수 있습니다. 이 개인정보 처리방침은 2024년 10월 1일부터
          적용됩니다. 서비스 이용과 관련하여 궁금하신 사항이 있으시면
          kswipe@gmail.com로 문의 주시기 바랍니다.
        </p>
        <NavigationBar/>
      </MainContainer>
    </div>
  );
};

export default PersonalInfo;
